w4d4/MusicApp/MusicApp/app/views/tracks/edit.html.erb

  <select id="album_list" name="track[album_id]">
    <% Album.all.each do |album| %>
---
SELECT "albums".* FROM "albums"