w4d4/MusicApp/MusicApp/app/views/tracks/new.html.erb

SELECT "albums".* FROM "albums"
---
    <option disabled selected>--Tracks--</option>
    <% Album.all.each do |album| %>