w4d4/MusicApp/MusicApp/app/controllers/albums_controller.rb

INSERT INTO "albums" ("band_id", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["band_id", 1], ["title", "Greatest Hits"], ["created_at", 2017-04-20 23:11:43 UTC], ["updated_at", 2017-04-20 23:11:43 UTC]]
---
  def create
    @album = Album.new(album_params)
    if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @album = Album.find_by(id: params[:id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["title", "Kryptonitea"], ["updated_at", 2017-04-21 00:38:12 UTC], ["id", 3]]
---
  def update
    @album = Album.find_by(id: params[:id])
    if @album
      @album.update_attributes(album_params)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 2]]
---
  def destroy
    @album = Album.find_by(id: params[:id])
    band = @album.band
    @album.destroy