w4d4/MusicApp/MusicApp/app/controllers/bands_controller.rb

  def update
    @band = Band.find_by(id: params[:id])
    if @band
      @band.update_attributes(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Third Eye Blinda"], ["updated_at", 2017-04-21 00:23:15 UTC], ["id", 2]]

  def destroy
    @band = Band.find_by(id: params[:id])
    @band.destroy
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 5]]