w4d4/MusicApp/MusicApp/app/controllers/tracks_controller.rb

  def create
    @track = Track.new(track_params)
    if @track.save
---
INSERT INTO "tracks" ("album_id", "song", "lyrics", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["album_id", 1], ["song", "Jumper"], ["lyrics", "I wish you would..."], ["created_at", 2017-04-20 23:41:34 UTC], ["updated_at", 2017-04-20 23:41:34 UTC]]

  def edit
    @track = Track.find_by(id: params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def show
    @track = Track.find_by(id: params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    @track = Track.find_by(id: params[:id])
    if @track
      @track.update_attributes(track_params)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "tracks" SET "song" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["song", "Kryptonitea"], ["updated_at", 2017-04-21 00:35:06 UTC], ["id", 8]]

  def destroy
    @track = Track.find_by(id: params[:id])
    album = @track.album
    @track.destroy
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 4]]