w4d4/MusicApp/MusicApp/app/views/bands/_band.html.erb

<%= button_to "Delete", band_url(band), method: :delete %>
<% band.albums.each do |album| %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 4]]