w4d4/MusicApp/MusicApp/app/views/albums/_album.html.erb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 2]]
---
<%= button_to "Delete", album_url(album), method: :delete %>
<% album.tracks.each do |track| %>