w4d4/MusicApp/MusicApp/app/views/albums/edit.html.erb

  <select id="band_list" name="album[band_id]">
    <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"