w4d4/MusicApp/MusicApp/app/views/albums/new.html.erb

    <option disabled selected>--Bands--</option>
    <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"